In [1]:
import pandas as pd

In [15]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [16]:
def extract_year(row):
    return row.split('-')[0]

In [17]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [18]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [19]:
def get_age(year,current_year):
    return current_year - int(year)

In [20]:
df['age'] = df['year'].apply(get_age, current_year=2024)

In [21]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   24
1  2002-09-24  2002   22
2  2005-12-20  2005   19

In [22]:
def get_introduce(age, prefix, suffix):
    return prefix + str(age) + suffix

In [27]:
df['introduce'] = df['age'].apply(get_introduce, prefix="i`m", suffix="years old")

In [28]:
df

   yyyy-mm-dd  year  age       introduce
0  2000-06-27  2000   24  i`m24years old
1  2002-09-24  2002   22  i`m22years old
2  2005-12-20  2005   19  i`m19years old

In [32]:
def get_introduce_2(row):
    return f'i was born in {row.age} my age is {str(row.age)}'

In [38]:
df = df.introduce = df.apply(get_introduce_2, axis=1)

In [39]:
df

0    i was born in 24 my age is 24
1    i was born in 22 my age is 22
2    i was born in 19 my age is 19
dtype: object